Tekla Open API Reference for Tekla Structures 2025
PreferredTextPlacingTypes.LeaderLinePlacingType Method
 The object is placed with a leader line.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PreferredPlacingTypeBase LeaderLinePlacingType()
Public Shared Function LeaderLinePlacingType As PreferredPlacingTypeBase
Return Value
Type: PreferredPlacingTypeBase
A new leader line placing type instance.
See Also
Reference
PreferredTextPlacingTypes Class
Tekla.Structures.Drawing Namespace